yes, it works on the direction that customers will see: going from Subscription-level scope to Resource-group level works fine:


Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.az_activity_log.azurerm_role_assignment.lacework must be replaced
-/+ resource "azurerm_role_assignment" "lacework" {
      ~ id                               = "/subscriptions/4c59c315-0e39-4ae5-82d8-8c0bbf639fd7/providers/Microsoft.Authorization/roleAssignments/6506b157-05f0-0e7d-29de-d49854d0d208" -> (known after apply)
      ~ name                             = "6506b157-05f0-0e7d-29de-d49854d0d208" -> (known after apply)
      ~ principal_type                   = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/4c59c315-0e39-4ae5-82d8-8c0bbf639fd7/providers/Microsoft.Authorization/roleDefinitions/9656771d-6fce-2909-5932-85cbddf09f31" -> (known after apply) # forces replacement
      ~ role_definition_name             = "lacework-role-7e97553d" -> (known after apply)
      ~ scope                            = "/subscriptions/4c59c315-0e39-4ae5-82d8-8c0bbf639fd7" -> "/subscriptions/4c59c315-0e39-4ae5-82d8-8c0bbf639fd7/resourceGroups/lacework-group-7e97553d" # forces replacement
      + skip_service_principal_aad_check = (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.az_activity_log.azurerm_role_definition.lacework must be replaced
-/+ resource "azurerm_role_definition" "lacework" {
      ~ assignable_scopes           = [
          - "/subscriptions/4c59c315-0e39-4ae5-82d8-8c0bbf639fd7",
          + "/subscriptions/4c59c315-0e39-4ae5-82d8-8c0bbf639fd7/resourceGroups/lacework-group-7e97553d",
        ]
      ~ id                          = "/subscriptions/4c59c315-0e39-4ae5-82d8-8c0bbf639fd7/providers/Microsoft.Authorization/roleDefinitions/9656771d-6fce-2909-5932-85cbddf09f31|/subscriptions/4c59c315-0e39-4ae5-82d8-8c0bbf639fd7" -> (known after apply)
        name                        = "lacework-role-7e97553d"
      ~ role_definition_id          = "9656771d-6fce-2909-5932-85cbddf09f31" -> (known after apply)
      ~ role_definition_resource_id = "/subscriptions/4c59c315-0e39-4ae5-82d8-8c0bbf639fd7/providers/Microsoft.Authorization/roleDefinitions/9656771d-6fce-2909-5932-85cbddf09f31" -> (known after apply)
      **~ scope                       = "/subscriptions/4c59c315-0e39-4ae5-82d8-8c0bbf639fd7" -> "/subscriptions/4c59c315-0e39-4ae5-82d8-8c0bbf639fd7/resourceGroups/lacework-group-7e97553d" # forces replacement
        # (1 unchanged attribute hidden)**

      ~ permissions {
          - not_actions      = [] -> null
          - not_data_actions = [] -> null
            # (2 unchanged attributes hidden)
        }
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

module.az_activity_log.azurerm_role_assignment.lacework: Destroying... [id=/subscriptions/4c59c315-0e39-4ae5-82d8-8c0bbf639fd7/providers/Microsoft.Authorization/roleAssignments/6506b157-05f0-0e7d-29de-d49854d0d208]
module.az_activity_log.azurerm_role_assignment.lacework: Destruction complete after 2s
module.az_activity_log.azurerm_role_definition.lacework: Destroying... [id=/subscriptions/4c59c315-0e39-4ae5-82d8-8c0bbf639fd7/providers/Microsoft.Authorization/roleDefinitions/9656771d-6fce-2909-5932-85cbddf09f31|/subscriptions/4c59c315-0e39-4ae5-82d8-8c0bbf639fd7]
module.az_activity_log.azurerm_role_definition.lacework: Destruction complete after 0s
module.az_activity_log.azurerm_role_definition.lacework: Creating...
module.az_activity_log.azurerm_role_definition.lacework: Creation complete after 1s [id=/subscriptions/4c59c315-0e39-4ae5-82d8-8c0bbf639fd7/providers/Microsoft.Authorization/roleDefinitions/1691987b-21e7-815d-7afc-2727ad1977a3|/subscriptions/4c59c315-0e39-4ae5-82d8-8c0bbf639fd7/resourceGroups/lacework-group-7e97553d]
module.az_activity_log.azurerm_role_assignment.lacework: Creating...
module.az_activity_log.azurerm_role_assignment.lacework: Still creating... [10s elapsed]
module.az_activity_log.azurerm_role_assignment.lacework: Still creating... [20s elapsed]
module.az_activity_log.azurerm_role_assignment.lacework: Creation complete after 24s [id=/subscriptions/4c59c315-0e39-4ae5-82d8-8c0bbf639fd7/resourceGroups/lacework-group-7e97553d/providers/Microsoft.Authorization/roleAssignments/6462411b-9221-7552-bb0b-21f0958e1f91]

Apply complete! Resources: 2 added, 0 changed, 2 destroyed.